Revit 2026 API

# SpaceOccupancyUnit Property

---

Get or set the Occupancy Unit of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public OccupancyUnit OccupancyUnit { get; set; }
```
```vb
Public Property OccupancyUnit As OccupancyUnit
	Get
	Set
```
```cpp
public:
property OccupancyUnit OccupancyUnit {
	OccupancyUnit get ();
	void set (OccupancyUnit value);
}
```
```fsharp
member OccupancyUnit : OccupancyUnit with get, set
```

#### Property Value

OccupancyUnit

This property is used to get or set the Occupancy Unit of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace